nanoframework/nf-interpreter/targets/ESP32/_common/targetHAL_ConfigurationManager.cpp
    // check wireless configs count
    if (networkWirelessConfigs != nullptr && networkWirelessConfigs->Count == 0)
    {
        // allocate memory for ONE network configuration
        HAL_Configuration_Wireless80211 *wirelessConfig =
            (HAL_Configuration_Wireless80211 *)platform_malloc(sizeof(HAL_Configuration_Wireless80211));

        InitialiseWirelessDefaultConfig(wirelessConfig, 0);

        StoreConfigBlock(
            DeviceConfigurationOption_Wireless80211Network,
            0,
            wirelessConfig,
            sizeof(HAL_Configuration_Wireless80211));

        // free memory
        platform_free(wirelessConfig);

        // have to enumerate again to pick it up
        networkWirelessConfigs = ConfigStorage_FindNetworkWireless80211ConfigurationBlocks();
    }

    // find wireless AP configuration blocks
    HAL_CONFIGURATION_NETWORK_WIRELESSAP *wirelessAPconfigs = ConfigStorage_FindNetworkWirelessAPConfigurationBlocks();

    // check wireless AP configs count
    if (wirelessAPconfigs != nullptr && wirelessAPconfigs->Count == 0)
    {
        // allocate memory for ONE wireless AP configuration
        HAL_Configuration_WirelessAP *wirelessAPConfig =
            (HAL_Configuration_WirelessAP *)platform_malloc(sizeof(HAL_Configuration_WirelessAP));

        InitialiseWirelessAPDefaultConfig(wirelessAPConfig, 0);

        StoreConfigBlock(
            DeviceConfigurationOption_WirelessNetworkAP,
            0,
            wirelessAPConfig,
            sizeof(HAL_Configuration_WirelessAP));

        // free memory
        platform_free(wirelessAPConfig);

        // have to enumerate again to pick it up
        wirelessAPconfigs = ConfigStorage_FindNetworkWirelessAPConfigurationBlocks();
    }

    // find X509 CA certificate blocks
    HAL_CONFIGURATION_X509_CERTIFICATE *certificateStore = ConfigStorage_FindX509CertificateConfigurationBlocks();

    // find X509 device certificate blocks
    HAL_CONFIGURATION_X509_DEVICE_CERTIFICATE *deviceCertificates =
        ConfigStorage_FindX509DeviceCertificatesConfigurationBlocks();

    g_TargetConfiguration.NetworkInterfaceConfigs = networkConfigs;
    g_TargetConfiguration.Wireless80211Configs = networkWirelessConfigs;
    g_TargetConfiguration.WirelessAPConfigs = wirelessAPconfigs;
    g_TargetConfiguration.CertificateStore = certificateStore;
    g_TargetConfiguration.DeviceCertificates = deviceCertificates;
}

// Build AP default SSID based on the last 3 bytes of MAC
// nano_xxxxxx
void CreateDefaultApSSID(HAL_Configuration_WirelessAP *config)
{
    uint8_t mac[6];
    esp_efuse_mac_get_default(mac);

    hal_strcpy_s((char *)config->Ssid, sizeof(config->Ssid), "nano_");
    char *pMac = (char *)config->Ssid + 5;

    // Last 3 bytes of MAC address
    for (int index = 3; index < 6; index++)
    {
        sprintf(pMac, "%02X", (int)mac[index]);
        pMac += 2;
    }
}

//  Default initialisation of wireless config blocks for ESP32 targets
void InitialiseWirelessDefaultConfig(HAL_Configuration_Wireless80211 *config, uint32_t configurationIndex)
{
    memset(config, 0, sizeof(HAL_Configuration_Wireless80211));

    // make sure the config block marker is set
    memcpy(config, c_MARKER_CONFIGURATION_WIRELESS80211_V1, sizeof(c_MARKER_CONFIGURATION_WIRELESS80211_V1));

    // Wireless station
    config->Id = configurationIndex;

    // Set default to Auto Connect + Enable + WirelessFlags_SmartConfig so station can be started by default
    // Once smart config has run will start up automatically and reconnect of disconnected
    // Application will have to disable Wi-Fi to save power etc
    // if Ethernet enable then disable
    // Disable Wi-Fi if Ethernet is enabled for all targets except esp32_p4 which by default will have both active at same time
#if !defined(CONFIG_IDF_TARGET_ESP32P4)
    if (ethernetEnabled)
    {
        config->Options = Wireless80211Configuration_ConfigurationOptions_Disable;
    }
    else
#endif
    {
        config->Options =
            (Wireless80211Configuration_ConfigurationOptions)(Wireless80211Configuration_ConfigurationOptions_AutoConnect |
                                                              Wireless80211Configuration_ConfigurationOptions_Enable |
                                                              Wireless80211Configuration_ConfigurationOptions_SmartConfig);
    }
}

//  Default initialisation of wireless config blocks for ESP32 targets
void InitialiseWirelessAPDefaultConfig(HAL_Configuration_WirelessAP *config, uint32_t configurationIndex)
{
    memset(config, 0, sizeof(HAL_Configuration_WirelessAP));

    // make sure the config block marker is set
    memcpy(config, c_MARKER_CONFIGURATION_WIRELESS_AP_V1, sizeof(c_MARKER_CONFIGURATION_WIRELESS_AP_V1));

    config->Id = configurationIndex;

    // Build AP default SSID/password based on MAC
    // but don't enable by default
    CreateDefaultApSSID(config);

    hal_strcpy_s((char *)config->Password, sizeof(config->Password), "nanoframework");

    config->Authentication = AuthenticationType_WPA2;
    config->Encryption = EncryptionType_WPA2;
    config->Radio = RadioType__802_11n;
    config->Channel = 11;
    config->MaxConnections = 4;

    // Disable Soft AP (default)
    config->Options = WirelessAPConfiguration_ConfigurationOptions_Disable;
}

//  Default initialisation of Network interface config blocks for ESP32 targets
bool InitialiseNetworkDefaultConfig(HAL_Configuration_NetworkInterface *config, uint32_t configurationIndex)
{
    int macType = -1;

    // make sure the config block marker is set
    memcpy(config->Marker, c_MARKER_CONFIGURATION_NETWORK_V1, sizeof(c_MARKER_CONFIGURATION_NETWORK_V1));

    switch (config->InterfaceType)
    {
        case NetworkInterfaceType_Wireless80211: // Wireless Station
            config->StartupAddressMode = AddressMode_DHCP;
            config->AutomaticDNS = 1;
            config->SpecificConfigId = 0;
            macType = ESP_MAC_WIFI_STA;
            break;

        case NetworkInterfaceType_WirelessAP: // Wireless AP
            config->StartupAddressMode = AddressMode_Static;
            config->SpecificConfigId = 0;
            macType = ESP_MAC_WIFI_SOFTAP;
            // Set default address 192.168.1.1
            // config->IPv4Address
            // config->IPv4NetMask
            // config->IPv4GatewayAddress
            break;

        case NetworkInterfaceType_Ethernet: // Ethernet
            config->StartupAddressMode = AddressMode_DHCP;
            config->AutomaticDNS = 1;
            macType = ESP_MAC_ETH;
            break;

#if HAL_USE_THREAD == TRUE
        case NetworkInterfaceType_Thread: // OpenThread  IPV6 only
            config->StartupAddressMode = AddressMode_Static;
            config->AutomaticDNS = 1;
            break;
#endif

        default:
            break;
    }

    if (macType != -1)
    {
        // get default MAC for interface
        if (esp_read_mac(config->MacAddress, (esp_mac_type_t)macType) != ESP_OK)
        {
            // On ESP32_P4 esp_read_mac can fail with host wifi
            esp_efuse_mac_get_default(config->MacAddress);
            config->MacAddress[5] += macType; // make sure each interface has a different MAC
        }
    }

    // always good
    return TRUE;
}

//
// Get the specified configuration block from global memory ( g_TargetConfiguration )
//
// Parameters:-
//   configurationBlock : Destination to copy configuration data
//   configuration      : Type of configuration block to copy
//   configurationIndex : Index of type to copy
//
// return:-
//    true - OK
//    false- Error/Not found
//
bool ConfigurationManager_GetConfigurationBlock(
    void *configurationBlock,
    DeviceConfigurationOption configuration,
    uint32_t configurationIndex)
{
    int sizeOfBlock = 0;

#ifdef DEBUG_CONFIG
    ets_printf("GetConfig %X %d, %d\n", configurationBlock, (int)configuration, configurationIndex);
#endif

    // validate if the requested block exists
    if (configuration == DeviceConfigurationOption_Network)
    {
        if (g_TargetConfiguration.NetworkInterfaceConfigs->Count == 0 ||
            (configurationIndex + 1) > g_TargetConfiguration.NetworkInterfaceConfigs->Count)
        {
            // there is no network config blocks, init one with default settings
#ifdef DEBUG_CONFIG
            ets_printf("GetConfig CN exit false\n");
#endif
            return false;
        }

        // set block size
        sizeOfBlock = sizeof(HAL_Configuration_NetworkInterface);
    }
    else if (configuration == DeviceConfigurationOption_Wireless80211Network)
    {
        if (g_TargetConfiguration.Wireless80211Configs->Count == 0 ||
            (configurationIndex + 1) > g_TargetConfiguration.Wireless80211Configs->Count)
        {
#ifdef DEBUG_CONFIG
            ets_printf("GetConfig WN exit false\n");
#endif
            return false;
        }

        // set block size
        sizeOfBlock = sizeof(HAL_Configuration_Wireless80211);
    }
    else if (configuration == DeviceConfigurationOption_WirelessNetworkAP)
    {
        if (g_TargetConfiguration.WirelessAPConfigs->Count == 0 ||
            (configurationIndex + 1) > g_TargetConfiguration.WirelessAPConfigs->Count)
        {
#ifdef DEBUG_CONFIG
            ets_printf("GetConfig AP exit false\n");
#endif
            return false;
        }

        // set block size
        sizeOfBlock = sizeof(HAL_Configuration_WirelessAP);
    }
    else if (configuration == DeviceConfigurationOption_X509CaRootBundle)
    {
        if (g_TargetConfiguration.CertificateStore->Count == 0 ||
            (configurationIndex + 1) > g_TargetConfiguration.CertificateStore->Count)
        {
#ifdef DEBUG_CONFIG
            ets_printf("GetConfig XC exit false\n");
#endif
            return false;
        }

        // set block size
        sizeOfBlock = ConfigurationManager_GetConfigurationBlockSize(DeviceConfigurationOption_X509CaRootBundle, 0);
    }
    else if (configuration == DeviceConfigurationOption_X509DeviceCertificates)
    {
        if (g_TargetConfiguration.DeviceCertificates->Count == 0 ||
            (configurationIndex + 1) > g_TargetConfiguration.DeviceCertificates->Count)
        {
#ifdef DEBUG_CONFIG
            ets_printf("GetConfig XC exit false\n");
#endif
            return false;
        }

        // set block size
        // because X509 certificate has a variable length need to compute the block size in two steps
        sizeOfBlock =
            ConfigurationManager_GetConfigurationBlockSize(DeviceConfigurationOption_X509DeviceCertificates, 0);
    }
    else
    {
        // unknown configuration option
        return false;
    }

