nanoframework/nf-interpreter/targets/ESP32/_common/targetHAL_ConfigurationManager.cpp
                // check if operation was successful
                if (result)
                {
                    // reset this
                    blockSize = 0;

                    // enumeration is required
                    requiresEnumeration = true;
                }
            }

#ifdef DEBUG_CONFIG
            ets_printf(
                "StoreDeviceCert blockSize:%d, certsize:%d",
                blockSize,
                ((HAL_Configuration_X509DeviceCertificate *)configurationBlock)->CertificateSize);
#endif
        }
        else
        {
            // Invalid Config
            return false;
        }
    }

    // Anything to save?
    if (blockSize != 0)
    {
        result = StoreConfigBlock(configuration, configurationIndex, configurationBlock, blockSize);
    }

    if (requiresEnumeration)
    {
        // perform enumeration of configuration blocks
        ConfigurationManager_EnumerateConfigurationBlocks();
    }

#ifdef DEBUG_CONFIG
    ets_printf("StoreConfig exit %d", result);
#endif

    return result;
}

// Updates a configuration block in the configuration storage
UpdateConfigurationResult ConfigurationManager_UpdateConfigurationBlock(
    void *configurationBlock,
    DeviceConfigurationOption configuration,
    uint32_t configurationIndex)
{
    // figure out the block size first
    uint32_t blockSize = 0;

    switch (configuration)
    {
        case DeviceConfigurationOption_Network:
            blockSize = sizeof(HAL_Configuration_NetworkInterface);
            break;

        case DeviceConfigurationOption_Wireless80211Network:
            blockSize = sizeof(HAL_Configuration_Wireless80211);
            break;

        case DeviceConfigurationOption_WirelessNetworkAP:
            blockSize = sizeof(HAL_Configuration_WirelessAP);
            break;

        case DeviceConfigurationOption_X509CaRootBundle:
            blockSize = offsetof(HAL_Configuration_X509CaRootBundle, Certificate);
            blockSize += ((HAL_Configuration_X509CaRootBundle *)configurationBlock)->CertificateSize;
            break;

        case DeviceConfigurationOption_X509DeviceCertificates:
            blockSize = offsetof(HAL_Configuration_X509DeviceCertificate, Certificate);
            blockSize += ((HAL_Configuration_X509DeviceCertificate *)configurationBlock)->CertificateSize;
            break;

        default:
            // shouldn't ever reach here
            return UpdateConfigurationResult_Failed;
    }

    if (ConfigurationManager_StoreConfigurationBlock(
            configurationBlock,
            configuration,
            configurationIndex,
            blockSize,
            0,
            false))
    {
        return UpdateConfigurationResult_Success;
    }
    else
    {
        return UpdateConfigurationResult_Failed;
    }
}

HAL_Configuration_Wireless80211 *ConfigurationManager_GetWirelessConfigurationFromId(uint32_t configurationId)
{
    HAL_Configuration_Wireless80211 *wirelessConfig =
        (HAL_Configuration_Wireless80211 *)platform_malloc(sizeof(HAL_Configuration_Wireless80211));

    if (wirelessConfig)
    {
        // loop though all Wireless config blocks trying to find one with this ID
        for (int index = 0; index < g_TargetConfiguration.Wireless80211Configs->Count; index++)
        {
            if (ConfigurationManager_GetConfigurationBlock(
                    wirelessConfig,
                    DeviceConfigurationOption_Wireless80211Network,
                    index))
            {

                if (wirelessConfig->Id == configurationId)
                {
                    return wirelessConfig;
                }
            }
        }
    }

    if (wirelessConfig != nullptr)
    {
        platform_free(wirelessConfig);
    }

    // not found, or failed to allocate memory
    return nullptr;
}

HAL_Configuration_WirelessAP *ConfigurationManager_GetWirelessAPConfigurationFromId(uint32_t configurationId)
{
    HAL_Configuration_WirelessAP *wirelessAPConfig =
        (HAL_Configuration_WirelessAP *)platform_malloc(sizeof(HAL_Configuration_WirelessAP));

    if (wirelessAPConfig)
    {
        // loop though all Wireless AP config blocks trying to find one with this ID
        for (int index = 0; index < g_TargetConfiguration.WirelessAPConfigs->Count; index++)
        {
            if (ConfigurationManager_GetConfigurationBlock(
                    wirelessAPConfig,
                    DeviceConfigurationOption_WirelessNetworkAP,
                    index))
            {

                if (wirelessAPConfig->Id == configurationId)
                {
                    return wirelessAPConfig;
                }
            }
        }
    }

    if (wirelessAPConfig != nullptr)
    {
        platform_free(wirelessAPConfig);
    }

    // not found, or failed to allocate memory
    return nullptr;
}

HAL_Configuration_X509CaRootBundle *ConfigurationManager_GetCertificateStore()
{
    if (g_TargetConfiguration.CertificateStore->Count)
    {
        // get cert store size
        int32_t certSize =
            ConfigurationManager_GetConfigurationBlockSize(DeviceConfigurationOption_X509CaRootBundle, 0);

        if (certSize > 0)
        {
            HAL_Configuration_X509CaRootBundle *certStore =
                (HAL_Configuration_X509CaRootBundle *)platform_malloc(certSize);

            if (certStore != nullptr)
            {
                if (ConfigurationManager_GetConfigurationBlock(
                        certStore,
                        DeviceConfigurationOption_X509CaRootBundle,
                        0))
                {
                    return certStore;
                }

                platform_free(certStore);
            }
        }
    }

    // not found, or failed to allocate memory
    return nullptr;
}

HAL_Configuration_X509DeviceCertificate *ConfigurationManager_GetDeviceCertificate()
{
    if (g_TargetConfiguration.DeviceCertificates->Count)
    {
        // get cert store size
        int32_t certSize =
            ConfigurationManager_GetConfigurationBlockSize(DeviceConfigurationOption_X509DeviceCertificates, 0);

        if (certSize > 0)
        {
            HAL_Configuration_X509DeviceCertificate *deviceCert =
                (HAL_Configuration_X509DeviceCertificate *)platform_malloc(certSize);

            if (deviceCert != nullptr)
            {
                if (ConfigurationManager_GetConfigurationBlock(
                        deviceCert,
                        DeviceConfigurationOption_X509DeviceCertificates,
                        0))
                {
                    return deviceCert;
                }

                platform_free(deviceCert);
            }
        }
    }

    // not found, or failed to allocate memory
    return nullptr;
}

// default implementation
// this is weak so a manufacturer can provide a strong implementation
__nfweak void ConfigurationManager_GetSystemSerialNumber(char *serialNumber, size_t serialNumberSize)
{
    memset(serialNumber, 0, serialNumberSize);

    // Use the factory-provided MAC address as unique ID
    uint8_t macAddress[6];
    esp_err_t err = esp_read_mac(macAddress, ESP_MAC_EFUSE_FACTORY);
    if (err == ESP_OK)
    {
        memcpy(&serialNumber[serialNumberSize - sizeof(macAddress)], macAddress, sizeof(macAddress));

        // Disambiguation is needed because the hardware-specific identifier used to create the
        // default serial number on other platforms may be in the same range.
        // Set the first byte to a number that is unique (within the nanoFramework CLR) for ESP32.
        serialNumber[0] = 1;
    }
}
